STMicroelectronics/STM32CubeWBA/Drivers/BSP/STM32WBA65I-DK1/stm32wba65i_discovery_bus.c
#if (USE_HAL_SPI_REGISTER_CALLBACKS == 0)
  SPI3_MspDeInit(&hbus_spi3);
#endif
  /* DeInit the SPI*/
  if(HAL_SPI_DeInit(&hbus_spi3) == HAL_OK)
  {
    ret = BSP_ERROR_BUS_FAILURE;
  }

  return ret;
}

/**
  * @brief  Initializes MX SPI3 HAL.
  * @param  phspi             SPI handler
  * @param  BaudratePrescaler prsecaler to set for SPI baudrate
  * @retval HAL status
  */
__weak HAL_StatusTypeDef MX_SPI3_Init(SPI_HandleTypeDef* phspi, uint32_t BaudratePrescaler)
{
  HAL_StatusTypeDef ret = HAL_OK;

  phspi->Init.Mode                    = SPI_MODE_MASTER;
  phspi->Init.Direction               = SPI_DIRECTION_2LINES;
  phspi->Init.DataSize                = SPI_DATASIZE_8BIT;
  phspi->Init.CLKPolarity             = SPI_POLARITY_LOW;
  phspi->Init.CLKPhase                = SPI_PHASE_1EDGE;
  phspi->Init.NSS                     = SPI_NSS_SOFT;
  phspi->Init.BaudRatePrescaler       = SPI_BAUDRATEPRESCALER_8;
  phspi->Init.FirstBit                = SPI_FIRSTBIT_MSB;
  phspi->Init.TIMode                  = SPI_TIMODE_DISABLE;
  phspi->Init.CRCCalculation          = SPI_CRCCALCULATION_DISABLE;
  phspi->Init.CRCPolynomial           = 7;
  phspi->Init.NSSPMode                = SPI_NSS_PULSE_DISABLE;
  phspi->Init.NSSPolarity             = SPI_NSS_POLARITY_LOW;
  phspi->Init.FifoThreshold           = SPI_FIFO_THRESHOLD_01DATA;
  phspi->Init.MasterSSIdleness        = SPI_MASTER_SS_IDLENESS_00CYCLE;
  phspi->Init.MasterInterDataIdleness = SPI_MASTER_INTERDATA_IDLENESS_00CYCLE;
  phspi->Init.MasterReceiverAutoSusp  = SPI_MASTER_RX_AUTOSUSP_DISABLE;
  phspi->Init.MasterKeepIOState       = SPI_MASTER_KEEP_IO_STATE_DISABLE;
  phspi->Init.IOSwap                  = SPI_IO_SWAP_DISABLE;
  phspi->Init.ReadyMasterManagement   = SPI_RDY_MASTER_MANAGEMENT_INTERNALLY;
  phspi->Init.ReadyPolarity           = SPI_RDY_POLARITY_HIGH;

  if(HAL_SPI_Init(phspi) != HAL_OK)
  {
    ret = HAL_ERROR;
  }

  return ret;
}

/**
  * @brief  Write Data through SPI BUS.
  * @param  pData  Pointer to data buffer to send
  * @param  Length Length of data in byte
  * @retval BSP status
  */
int32_t BSP_SPI3_Send(uint8_t *pData, uint16_t Length)
{
  int32_t ret = BSP_ERROR_NONE;
  int16_t remaining_length = Length;

  if (IS_SPI_LIMITED_INSTANCE(hbus_spi3.Instance))
  {
    while (( remaining_length > BUS_SPI3_TSIZE_MAX) && (ret == BSP_ERROR_NONE))
    {
      if(HAL_SPI_Transmit(&hbus_spi3, pData, BUS_SPI3_TSIZE_MAX, BUS_SPI3_TIMEOUT) == HAL_OK)
      {
        ret = BSP_ERROR_NONE;
      }
      else
      {
        ret = BSP_ERROR_UNKNOWN_FAILURE;
      }
      remaining_length = remaining_length - BUS_SPI3_TSIZE_MAX;
      pData += BUS_SPI3_TSIZE_MAX;
    }
    if ((ret == BSP_ERROR_NONE) && (HAL_SPI_Transmit(&hbus_spi3, pData, remaining_length, BUS_SPI3_TIMEOUT) == HAL_OK))
    {
      ret = BSP_ERROR_NONE;
    }
    else
    {
      ret = BSP_ERROR_UNKNOWN_FAILURE;
    }
  }
  else
  {
    if(HAL_SPI_Transmit(&hbus_spi3, pData, Length, BUS_SPI3_TIMEOUT) == HAL_OK)
    {
      ret = BSP_ERROR_NONE;
    }
  }
  return ret;
}

/**
  * @brief  Receive Data from SPI BUS
  * @param  pData  Pointer to data buffer to receive
  * @param  Length Length of data in byte
  * @retval BSP status
  */
int32_t  BSP_SPI3_Recv(uint8_t *pData, uint16_t Length)
{
  int32_t ret = BSP_ERROR_NONE;
  int32_t remaining_length = Length;

  if (IS_SPI_LIMITED_INSTANCE(hbus_spi3.Instance))
  {
    while (( remaining_length > BUS_SPI3_TSIZE_MAX) && (ret == BSP_ERROR_NONE))
    {
      if(HAL_SPI_Receive(&hbus_spi3, pData, BUS_SPI3_TSIZE_MAX, BUS_SPI3_TIMEOUT) == HAL_OK)
      {
        ret = BSP_ERROR_NONE;
      }
      else
      {
        ret = BSP_ERROR_UNKNOWN_FAILURE;
      }
      remaining_length = remaining_length - BUS_SPI3_TSIZE_MAX;
      pData += BUS_SPI3_TSIZE_MAX;
    }
    if ((ret == BSP_ERROR_NONE) && (HAL_SPI_Receive(&hbus_spi3, pData, remaining_length, BUS_SPI3_TIMEOUT) == HAL_OK))
    {
      ret = BSP_ERROR_NONE;
    }
    else
    {
      ret = BSP_ERROR_UNKNOWN_FAILURE;
    }
  }
  else
  {
    if(HAL_SPI_Receive(&hbus_spi3, pData, Length, BUS_SPI3_TIMEOUT) == HAL_OK)
    {
      ret = BSP_ERROR_NONE;
    }
  }
  return ret;
}

/**
  * @brief  Send and Receive data to/from SPI BUS (Full duplex)
  * @param  pTxData  Pointer to data buffer to send
  * @param  pRxData  Pointer to data buffer to receive
  * @param  Length   Length of data in byte
  * @retval BSP status
  */
int32_t BSP_SPI3_SendRecv(uint8_t *pTxData, uint8_t *pRxData, uint16_t Length)
{
  int32_t ret = BSP_ERROR_UNKNOWN_FAILURE;

  if(HAL_SPI_TransmitReceive(&hbus_spi3, pTxData, pRxData, Length, BUS_SPI3_TIMEOUT) == HAL_OK)
  {
    ret = BSP_ERROR_NONE;
  }

  return ret;
}

/**
  * @brief  Delay function
  * @retval Tick value
  */
int32_t BSP_GetTick(void)
{
  return (int32_t)HAL_GetTick();
}

#if (USE_HAL_I2C_REGISTER_CALLBACKS > 0)
/**
  * @brief Register Default I2C1 Bus Msp Callbacks
  * @retval BSP status
  */
int32_t BSP_I2C1_RegisterDefaultMspCallbacks(void)
{
  int32_t ret = BSP_ERROR_NONE;

#if defined(BSP_USE_CMSIS_OS)
  /* Get semaphore to prevent multiple I2C access */
  osSemaphoreWait(BspI2cSemaphore, osWaitForever);
#endif /* BSP_USE_CMSIS_OS */
  __HAL_I2C_RESET_HANDLE_STATE(&hbus_i2c1);

  /* Register default MspInit/MspDeInit Callback */
  if (HAL_I2C_RegisterCallback(&hbus_i2c1, HAL_I2C_MSPINIT_CB_ID, I2C1_MspInit) != HAL_OK)
  {
    ret = BSP_ERROR_PERIPH_FAILURE;
  }
  else if (HAL_I2C_RegisterCallback(&hbus_i2c1, HAL_I2C_MSPDEINIT_CB_ID, I2C1_MspDeInit) != HAL_OK)
  {
    ret = BSP_ERROR_PERIPH_FAILURE;
  }
  else
  {
    IsI2c1MspCbValid = 1U;
  }

#if defined(BSP_USE_CMSIS_OS)
  /* Release semaphore to prevent multiple I2C access */
  osSemaphoreRelease(BspI2cSemaphore);
#endif /* BSP_USE_CMSIS_OS */
  /* BSP status */
  return ret;
}

/**
  * @brief Register I2C1 Bus Msp Callback registering
  * @param Callbacks     pointer to I2C1 MspInit/MspDeInit callback functions
  * @retval BSP status
  */
int32_t BSP_I2C1_RegisterMspCallbacks(BSP_I2C_Cb_t *Callback)
{
  int32_t ret = BSP_ERROR_NONE;

