STMicroelectronics/STM32CubeWBA/Drivers/BSP/STM32WBA65I-DK1/stm32wba65i_discovery_bus.c
#if defined(BSP_USE_CMSIS_OS)
  /* Get semaphore to prevent multiple I2C access */
  osSemaphoreWait(BspI2cSemaphore, osWaitForever);
#endif /* BSP_USE_CMSIS_OS */
  __HAL_I2C_RESET_HANDLE_STATE(&hbus_i2c1);

  /* Register MspInit/MspDeInit Callbacks */
  if (HAL_I2C_RegisterCallback(&hbus_i2c1, HAL_I2C_MSPINIT_CB_ID, Callback->pMspI2cInitCb) != HAL_OK)
  {
    ret = BSP_ERROR_PERIPH_FAILURE;
  }
  else if (HAL_I2C_RegisterCallback(&hbus_i2c1, HAL_I2C_MSPDEINIT_CB_ID, Callback->pMspI2cDeInitCb) != HAL_OK)
  {
    ret = BSP_ERROR_PERIPH_FAILURE;
  }
  else
  {
    IsI2c1MspCbValid = 1U;
  }
#if defined(BSP_USE_CMSIS_OS)
  /* Release semaphore to prevent multiple I2C access */
  osSemaphoreRelease(BspI2cSemaphore);
#endif /* BSP_USE_CMSIS_OS */

  /* BSP status */
  return ret;
}
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */

#if (USE_HAL_SPI_REGISTER_CALLBACKS == 1)
/**
  * @brief Register Default SPI3 Bus Msp Callbacks
  * @retval BSP status
  */
int32_t BSP_SPI3_RegisterDefaultMspCallbacks (void)
{
  __HAL_SPI_RESET_HANDLE_STATE(&hbus_spi3);

  /* Register MspInit Callback */
  if(HAL_SPI_RegisterCallback(&hbus_spi3, HAL_SPI_MSPINIT_CB_ID, SPI3_MspInit) != HAL_OK)
  {
    return BSP_ERROR_PERIPH_FAILURE;
  }

  /* Register MspDeInit Callback */
  if(HAL_SPI_RegisterCallback(&hbus_spi3, HAL_SPI_MSPDEINIT_CB_ID, SPI3_MspDeInit) != HAL_OK)
  {
    return BSP_ERROR_PERIPH_FAILURE;
  }

  IsSpi3MspCbValid = 1;

  return BSP_ERROR_NONE;
}

/**
  * @brief Register SPI3 Bus Msp Callback registering
  * @param Callbacks     pointer to SPI3 MspInit/MspDeInit callback functions
  * @retval BSP status
  */
int32_t BSP_SPI3_RegisterMspCallbacks(BSP_SPI3_Cb_t *Callbacks)
{
  __HAL_SPI_RESET_HANDLE_STATE(&hbus_spi3);

  /* Register MspInit Callback */
  if(HAL_SPI_RegisterCallback(&hbus_spi3, HAL_SPI_MSPINIT_CB_ID, Callbacks->pMspSpiInitCb) != HAL_OK)
  {
    return BSP_ERROR_PERIPH_FAILURE;
  }

  /* Register MspDeInit Callback */
  if(HAL_SPI_RegisterCallback(&hbus_spi3, HAL_SPI_MSPDEINIT_CB_ID, Callbacks->pMspSpiDeInitCb) != HAL_OK)
  {
    return BSP_ERROR_PERIPH_FAILURE;
  }

  IsSpi3MspCbValid = 1;

  return BSP_ERROR_NONE;
}

#endif /* (USE_HAL_SPI_REGISTER_CALLBACKS == 1) */

/**
  * @brief  Initializes SPI MSP.
  * @param  hspi  SPI handler
  * @retval None
  */
static void SPI3_MspInit(SPI_HandleTypeDef* hspi)
{
  GPIO_InitTypeDef   GPIO_InitStructure;

  /* Prevent unused argument(s) compilation warning */
  UNUSED(hspi);

  /* enable SCK GPIO clock */
  BUS_SPI3_SCK_GPIO_CLK_ENABLE();

  /* Enable MOSI GPIO clock */
  BUS_SPI3_MOSI_GPIO_CLK_ENABLE();

  /* Enable MISO GPIO clock */
  BUS_SPI3_MISO_GPIO_CLK_ENABLE();

  /* configure SPIx SCK, MOSI */
  GPIO_InitStructure.Pin       = BUS_SPI3_SCK_PIN;
  GPIO_InitStructure.Mode      = GPIO_MODE_AF_PP;
  GPIO_InitStructure.Pull      = GPIO_NOPULL;
  GPIO_InitStructure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStructure.Alternate = BUS_SPI3_SCK_AF;
  HAL_GPIO_Init(BUS_SPI3_SCK_GPIO_PORT, &GPIO_InitStructure);

  GPIO_InitStructure.Pin       = BUS_SPI3_MOSI_PIN;
  GPIO_InitStructure.Mode      = GPIO_MODE_AF_PP;
  GPIO_InitStructure.Pull      = GPIO_NOPULL;
  GPIO_InitStructure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStructure.Alternate = BUS_SPI3_MOSI_AF;
  HAL_GPIO_Init(BUS_SPI3_MOSI_GPIO_PORT, &GPIO_InitStructure);

  GPIO_InitStructure.Pin       = BUS_SPI3_MISO_PIN;
  GPIO_InitStructure.Mode      = GPIO_MODE_AF_PP;
  GPIO_InitStructure.Pull      = GPIO_NOPULL;
  GPIO_InitStructure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStructure.Alternate = BUS_SPI3_MISO_AF;
  HAL_GPIO_Init(BUS_SPI3_MISO_GPIO_PORT, &GPIO_InitStructure);

  /*** Configure the SPI peripheral ***/
  /* Enable SPI clock */
  BUS_SPI3_CLOCK_ENABLE();

  /* Force the SPI peripheral clock reset */
  BUS_SPI3_FORCE_RESET();

  /* Release the SPI peripheral clock reset */
  BUS_SPI3_RELEASE_RESET();
}

/**
  * @brief  DeInitializes SPI MSP.
  * @param  hspi  SPI handler
  * @retval None
  */
static void SPI3_MspDeInit(SPI_HandleTypeDef* hspi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hspi);

  GPIO_InitTypeDef gpio_init_structure;

  /* DeInitialize SPI SCK and MOSI  */
  gpio_init_structure.Pin = BUS_SPI3_SCK_PIN;
  HAL_GPIO_DeInit(BUS_SPI3_SCK_GPIO_PORT, gpio_init_structure.Pin);
  gpio_init_structure.Pin = BUS_SPI3_MOSI_PIN;
  HAL_GPIO_DeInit(BUS_SPI3_MOSI_GPIO_PORT, gpio_init_structure.Pin);

  /* Peripheral clock disable */
  __HAL_RCC_SPI3_CLK_DISABLE();
}

/**
  * @}
  */

/** @defgroup STM32WBA65I_DK1_BUS_Private_Functions BUS Private Functions
  * @{
  */
/**
  * @brief  Compute I2C timing according current I2C clock source and required I2C clock.
  * @param  clock_src_freq I2C clock source in Hz.
  * @param  i2c_freq Required I2C clock in Hz.
  * @retval I2C timing or 0 in case of error.
  */
static uint32_t I2C_GetTiming(uint32_t clock_src_freq, uint32_t i2c_freq)
{
  uint32_t ret = 0;
  uint32_t speed;
  uint32_t idx;

  I2c_valid_timing_nbr = 0;

  if ((clock_src_freq != 0U) && (i2c_freq != 0U))
  {
    for (speed = 0 ; speed <= (uint32_t)I2C_SPEED_FREQ_FAST_PLUS ; speed++)
    {
      if ((i2c_freq >= I2C_Charac[speed].freq_min) &&
          (i2c_freq <= I2C_Charac[speed].freq_max))
      {
        I2C_Compute_PRESC_SCLDEL_SDADEL(clock_src_freq, speed);
        idx = I2C_Compute_SCLL_SCLH(clock_src_freq, speed);

        if (idx < I2C_VALID_TIMING_NBR)
        {
          ret = ((I2c_valid_timing[idx].presc  & 0x0FU) << 28) | \
                ((I2c_valid_timing[idx].tscldel & 0x0FU) << 20) | \
                ((I2c_valid_timing[idx].tsdadel & 0x0FU) << 16) | \
                ((I2c_valid_timing[idx].sclh & 0xFFU) << 8) | \
                ((I2c_valid_timing[idx].scll & 0xFFU) << 0);
        }
        break;
      }
    }
  }

  return ret;
}

/**
  * @brief  Compute PRESC, SCLDEL and SDADEL.
  * @param  clock_src_freq I2C source clock in HZ.
  * @param  I2C_speed I2C frequency (index).
  * @retval None.
  */
static void I2C_Compute_PRESC_SCLDEL_SDADEL(uint32_t clock_src_freq, uint32_t I2C_speed)
{
  uint32_t prev_presc = I2C_PRESC_MAX;
  uint32_t ti2cclk;
  int32_t  tsdadel_min;
  int32_t  tsdadel_max;
  int32_t  tscldel_min;
  uint32_t presc;
  uint32_t scldel;
  uint32_t sdadel;
  uint32_t tafdel_min;
  uint32_t tafdel_max;

  ti2cclk   = (SEC2NSEC + (clock_src_freq / 2U)) / clock_src_freq;

